particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
/*
 * Copyright (c) 2022 Particle Industries, Inc.  All rights reserved.
 *
 * This library is free software; you can redistribute it and/or
 * modify it under the terms of the GNU Lesser General Public
 * License as published by the Free Software Foundation, either
 * version 3 of the License, or (at your option) any later version.
 *
 * This library is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
 * Lesser General Public License for more details.
 *
 * You should have received a copy of the GNU Lesser General Public
 * License along with this library; if not, see <http://www.gnu.org/licenses/>.
 */

#define LOG_COMPILE_TIME_LEVEL LOG_LEVEL_TRACE
#include "logging.h"
LOG_SOURCE_CATEGORY("hal.ble");

#include "ble_hal.h"

#if HAL_PLATFORM_BLE

extern "C" {
#include "rtl8721d.h"
#include "rtl8721d_efuse.h"
#include "rtk_coex.h"
}

#include <platform_opts_bt.h>
#include <os_sched.h>
#include <string.h>
#include <trace_app.h>
#include <gap.h>
#include <gap_adv.h>
#include <gap_scan.h>
#include <gap_bond_le.h>
#include <gap_le.h>
#include <gap_conn_le.h>
#include <profile_server.h>
#include <profile_client.h>
#include <gatt_builtin_services.h>
#include <gap_msg.h>
#include <simple_ble_service.h>
#include <bas.h>
#include <bte.h>
#include <gap_config.h>
#include <bt_flags.h>
#include <stdio.h>
#include "wifi_constants.h"
#include <wifi/wifi_conf.h>
#include "rtk_coex.h"
#include "ftl_int.h"
#include "bt_intf.h"

//FIXME
#include "app_msg.h"
#include "os_msg.h"
#include "os_task.h"

#include "delay_hal.h"
#include "device_code.h"
#include "concurrent_hal.h"
#include "static_recursive_mutex.h"
#include <mutex>
#include "spark_wiring_vector.h"
#include <string.h>
#include <memory>
#include "check.h"
#include "scope_guard.h"
#include "rtl_system_error.h"
#include "radio_common.h"

#include "timer_hal.h"

#include "mbedtls/ecdh.h"
#include "mbedtls_util.h"
#include "spark_wiring_thread.h"

// FIXME
#undef OFF
#undef ON
#include "network/ncp/wifi/ncp.h"
#include "network/ncp/wifi/wifi_network_manager.h"
#include "network/ncp/wifi/wifi_ncp_client.h"
#include "rtl_sdk_support.h"

using spark::Vector;
using namespace particle;
using namespace particle::ble;

extern "C" void __real_bt_coex_handle_specific_evt(uint8_t* p, uint8_t len);
extern "C" void __wrap_bt_coex_handle_specific_evt(uint8_t* p, uint8_t len);
extern "C" int rltk_coex_set_wifi_slot(u8 wifi_slot);

// #define BT_COEX_DEBUG

void __wrap_bt_coex_handle_specific_evt(uint8_t* p, uint8_t len) {
	__real_bt_coex_handle_specific_evt(p, len);
#ifdef BT_COEX_DEBUG
    LOG(INFO, "btcoex event len=%u", (unsigned)len);
    LOG_DUMP(INFO, p, len);
    LOG_PRINTF(INFO, "\r\n");
#endif // BT_COEX_DEBUG
}

namespace {

// Give MTU exchange 1.5 seconds to complete
constexpr system_tick_t BLE_ATT_MTU_EXCHANGE_TIMEOUT_MS = 1500;

// FIXME: should probably move under some class here
StaticRecursiveMutex sBleEventMutex;

#define WRAP_BLE_EVT_LOCK(_expr) \
        ({ \
            std::lock_guard<StaticRecursiveMutex> _lk(sBleEventMutex); \
            _expr; \
        })

#define CHECK_RTL(_expr) \
        ({ \
            const auto _ret = _expr; \
            if (_ret != GAP_CAUSE_SUCCESS) { \
                _LOG_CHECKED_ERROR(_expr, rtl_ble_error_to_system(_ret)); \
                return rtl_ble_error_to_system(_ret); \
            } \
            _ret; \
        })

#define WAIT_TIMED(timeout_ms, what) ({ \
    system_tick_t _micros = HAL_Timer_Get_Micro_Seconds();                      \
    bool res = true;                                                            \
    while ((what)) {                                                            \
        system_tick_t dt = (HAL_Timer_Get_Micro_Seconds() - _micros);           \
        bool nok = (((timeout_ms * 1000) < dt) && (what));                      \
        if (nok) {                                                              \
            res = false;                                                        \
            break;                                                              \
        }                                                                       \
    }                                                                           \
    res;                                                                        \
})

#if 0
#define LOCAL_DEBUG(_fmt, ...) \
        do { \
            LOG(TRACE, _fmt "\r\n", ##__VA_ARGS__); \
        } while (false)
#else
#define LOCAL_DEBUG(_fmt, ...)
#endif

constexpr uint32_t BLE_OPERATION_TIMEOUT_MS = 60000;
constexpr system_tick_t BLE_ENQUEUE_TIMEOUT_MS = 5000;

StaticRecursiveMutex s_bleMutex;

int hal_ble_try_lock(void* reserved) {
    return !s_bleMutex.lock(1);
}

#define TRY_LOCK_GUARD(_expr) \
        ({ \
            if (hal_ble_try_lock(nullptr) != 0) { \
                return SYSTEM_ERROR_BUSY; \
            } \
            SCOPE_GUARD({ \
                hal_ble_unlock(nullptr); \
            }); \
            _expr; \
        })

bool isUuidEqual(const hal_ble_uuid_t* uuid1, const hal_ble_uuid_t* uuid2) {
    if (uuid1->type != uuid2->type) {
        return false;
    }
    if (uuid1->type == BLE_UUID_TYPE_128BIT) {
        return memcmp(uuid1->uuid128, uuid2->uuid128, BLE_SIG_UUID_128BIT_LEN) == 0;
    } else {
        return uuid1->uuid16 == uuid2->uuid16;
    }
}

bool addressEqual(const hal_ble_addr_t& srcAddr, const hal_ble_addr_t& destAddr) {
    return (srcAddr.addr_type == destAddr.addr_type && !memcmp(srcAddr.addr, destAddr.addr, BLE_SIG_ADDR_LEN));
}

hal_ble_addr_t chipDefaultPublicAddress() {
    hal_ble_addr_t localAddr = {};
    uint8_t mac[BLE_SIG_ADDR_LEN] = {};
    if (hal_get_mac_address(HAL_DEVICE_MAC_BLE, mac, BLE_SIG_ADDR_LEN, nullptr) == BLE_SIG_ADDR_LEN) {
        // As per BLE spec, we store BLE data in little-endian
        for (uint8_t i = 0, j = BLE_SIG_ADDR_LEN - 1; i < BLE_SIG_ADDR_LEN; i++, j--) {
            localAddr.addr[i] = mac[j];
        }
        localAddr.addr_type = BLE_SIG_ADDR_TYPE_PUBLIC;
    }
    return localAddr;
}

