particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
T_GAP_IO_CAP toPlatformIoCaps(hal_ble_pairing_io_caps_t index) {
    constexpr T_GAP_IO_CAP iocaps[] = {
        GAP_IO_CAP_NO_INPUT_NO_OUTPUT,
        GAP_IO_CAP_DISPLAY_ONLY,
        GAP_IO_CAP_DISPLAY_YES_NO,
        GAP_IO_CAP_KEYBOARD_ONLY,
        GAP_IO_CAP_KEYBOARD_DISPLAY
    };
    return iocaps[index];
}

} //anonymous namespace


class BleEventDispatcher {
public:
    int start();
    int stop();

    static BleEventDispatcher& getInstance() {
        static BleEventDispatcher instance;
        return instance;
    }

    bool isThreadCurrent() const {
        if (!thread_) {
            return false;
        }

        return os_thread_current(nullptr) == thread_;
    }

private:
    BleEventDispatcher()
            : thread_(nullptr),
              allEvtQueue_(nullptr),
              ioEvtQueue_(nullptr),
              started_(false) {
    }
    ~BleEventDispatcher() = default;

    void handleIoMessage(T_IO_MSG message) const;
    static void bleEventDispatchThread(void *context);

    void cleanup();

    void* thread_;
    void* allEvtQueue_;
    void* ioEvtQueue_;
    bool started_;
    static constexpr uint8_t BLE_EVENT_THREAD_PRIORITY = OS_THREAD_PRIORITY_NETWORK - 1; // IMPORTANT: below network for coexistence to work!
    static constexpr uint8_t MAX_NUMBER_OF_GAP_MESSAGE = 0x20;
    static constexpr uint8_t MAX_NUMBER_OF_IO_MESSAGE = 0x20;
    static constexpr uint8_t MAX_NUMBER_OF_EVENT_MESSAGE = (MAX_NUMBER_OF_GAP_MESSAGE + MAX_NUMBER_OF_IO_MESSAGE);
    static constexpr uint8_t BLE_EVENT_STOP = 0xff;
};

union RtlGapDevState {
    T_GAP_DEV_STATE state;
    uint8_t raw;
    static_assert(sizeof(state) == sizeof(raw), "Size of T_GAP_DEV_STATE does not match uint8_t");
};

class BleGapDevState {
public:
    BleGapDevState()
            : state_{},
              initSet_{false},
              advSet_{false},
              advSubSet_{false},
              scanSet_{false},
              connSet_{false} {
    }

    explicit BleGapDevState(RtlGapDevState s)
            : state_(s),
              initSet_{true},
              advSet_{true},
              advSubSet_{true},
              scanSet_{true},
              connSet_{true} {
    }

    BleGapDevState(BleGapDevState&& other) = default;
    BleGapDevState(const BleGapDevState& other) = default;

    BleGapDevState& init(uint8_t state) {
        state_.state.gap_init_state = state;
        initSet_ = true;
        return *this;
    }
    BleGapDevState& adv(uint8_t state) {
        state_.state.gap_adv_state = state;
        advSet_ = true;
        return *this;
    }
    BleGapDevState& advSub(uint8_t state) {
        state_.state.gap_adv_sub_state = state;
        advSubSet_ = true;
        return *this;
    }
    BleGapDevState& scan(uint8_t state) {
        state_.state.gap_scan_state = state;
        scanSet_ = true;
        return *this;
    }
    BleGapDevState& conn(uint8_t state) {
        state_.state.gap_conn_state = state;
        connSet_ = true;
        return *this;
    }

    bool operator==(const BleGapDevState& other) {
        auto a = sanitizedState();
        auto b = other.sanitizedState();
        return !memcmp(&a, &b, sizeof(a));
    }

    BleGapDevState& copySetParamsFrom(const BleGapDevState& other) {
        initSet_ = other.initSet_;
        advSet_ = other.advSet_;
        advSubSet_ = other.advSubSet_;
        scanSet_ = other.scanSet_;
        connSet_ = other.connSet_;
        return *this;
    }

    bool isNotInitialized() const {
        T_GAP_DEV_STATE state = {};
        return initSet_ && advSet_ && advSubSet_ && scanSet_ && connSet_ && !memcmp(&state, &state_, sizeof(state));
    }

    RtlGapDevState state() const {
        return state_;
    }

private:
    RtlGapDevState sanitizedState() const {
        auto state = state_;
        if (!initSet_) {
            state.state.gap_init_state = 0;
        }
        if (!advSet_) {
            state.state.gap_adv_state = 0;
        }
        if (!advSubSet_) {
            state.state.gap_adv_sub_state = 0;
        }
        if (!scanSet_) {
            state.state.gap_scan_state = 0;
        }
        if (!connSet_) {
            state.state.gap_conn_state = 0;
        }
        return state;
    }

    RtlGapDevState state_;
    bool initSet_;
    bool advSet_;
    bool advSubSet_;
    bool scanSet_;
    bool connSet_;
};

class BleGap {
public:
    int start();
    int stop(bool restore = true);
    int init();

    bool initialized() const {
        return initialized_;
    }
    int setAppearance(uint16_t appearance) const;
    int setDeviceName(const char* deviceName, size_t len);
    int getDeviceName(char* deviceName, size_t len) const;
    int setDeviceAddress(const hal_ble_addr_t* address);
    int getDeviceAddress(hal_ble_addr_t* address) const;

    int setAdvertisingParameters(const hal_ble_adv_params_t* params);
    int getAdvertisingParameters(hal_ble_adv_params_t* params) const;
    int setAdvertisingData(const uint8_t* buf, size_t len);
    ssize_t getAdvertisingData(uint8_t* buf, size_t len) const;
    int setScanResponseData(const uint8_t* buf, size_t len);
    ssize_t getScanResponseData(uint8_t* buf, size_t len) const;
    int startAdvertising(bool wait = true); // TODO: always wait, now we have command thread to execute asynchronously
    int stopAdvertising(bool wait = true); // TODO: always wait, now we have command thread to execute asynchronously
    int notifyAdvStop();
    int setAutoAdvertiseScheme(hal_ble_auto_adv_cfg_t config);
    int getAutoAdvertiseScheme(hal_ble_auto_adv_cfg_t* cfg);

    bool isAdvertising() const {
        return isAdvertising_;
    }

    bool scanning();
    int setScanParams(const hal_ble_scan_params_t* params);
    int getScanParams(hal_ble_scan_params_t* params) const;
    int startScanning(hal_ble_on_scan_result_cb_t callback, void* context);
    int stopScanning(bool resetStack = false);

    int setPpcp(const hal_ble_conn_params_t* ppcp);
    int getPpcp(hal_ble_conn_params_t* ppcp) const;
    int connect(const hal_ble_conn_cfg_t* config, hal_ble_conn_handle_t* conn_handle);
    int connectCancel(const hal_ble_addr_t* address);
    ssize_t getAttMtu(hal_ble_conn_handle_t connHandle);
    int getConnectionInfo(hal_ble_conn_handle_t connHandle, hal_ble_conn_info_t* info);
    int disconnect(hal_ble_conn_handle_t connHandle);
    int disconnectAll();
    bool valid(hal_ble_conn_handle_t connHandle);

    bool connected(const hal_ble_addr_t* address) {
        if (address == nullptr) {
            std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
            return connections_.size() > 0;
        }
        if (peekConnection(address).valid()) {
            return true;
        }
        return false;
    }

    bool connecting() const {
        return connecting_;
    }

    int setPairingConfig(const hal_ble_pairing_config_t* config);
    int getPairingConfig(hal_ble_pairing_config_t* config) const;
    int setPairingAuthData(hal_ble_conn_handle_t connHandle, const hal_ble_pairing_auth_data_t* auth);
    int startPairing(hal_ble_conn_handle_t connHandle);
    int rejectPairing(hal_ble_conn_handle_t connHandle);
    bool isPairing(hal_ble_conn_handle_t connHandle);
    bool isPaired(hal_ble_conn_handle_t connHandle);

    int waitState(BleGapDevState state, system_tick_t timeout = BLE_STATE_DEFAULT_TIMEOUT, bool forcePoll = false);

