particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
    static constexpr system_tick_t BLE_WAIT_STATE_POLL_PERIOD_MS = 10;
    // IMPORTANT: large enough, some of the state changes are dependent
    // on callback execution etc.
    static constexpr system_tick_t BLE_STATE_DEFAULT_TIMEOUT = 10000;

    static constexpr uint8_t BLE_CMD_THREAD_PRIORITY = OS_THREAD_PRIORITY_NETWORK - 1; // IMPORTANT: below network for coexistence to work!
    static constexpr uint16_t BLE_CMD_THREAD_STACK_SIZE = 2048;
    static constexpr uint8_t BLE_CMD_QUEUE_SIZE = 0x20;

    volatile bool bleCommandThreadExit_ = false;
    static constexpr system_tick_t BLE_WAIT_CMD_THREAD_TRY_LOCK = 10;
};


class BleGatt {
public:
    struct Subscriber {
        hal_ble_conn_handle_t connHandle;
        ble_sig_cccd_value_t config;
    };

    struct CccdConfig {
        uint16_t index;
        Subscriber subscriber; // FIXME: now we assume that only one client is connected
    };

    struct BleCharacteristic {
        hal_ble_attr_handle_t handle;
        uint16_t index;
        hal_ble_on_char_evt_cb_t callback;
        void* context;
    };

    struct BleService {
        T_SERVER_ID id;
        Vector<T_ATTRIB_APPL> attrTable;
        hal_ble_uuid_t uuid;
        hal_ble_attr_handle_t startHandle;
        hal_ble_attr_handle_t endHandle; 
        Vector<BleCharacteristic> characteristics;
        Vector<CccdConfig> cccdConfigs;
    };

    int init();
    int deinit();
    int addService(uint8_t type, const hal_ble_uuid_t* uuid, hal_ble_attr_handle_t* svcHandle);
    int addCharacteristic(const hal_ble_char_init_t* charInit, hal_ble_char_handles_t* charHandles);
    int registerAttributeTable();
    ssize_t setValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len);
    ssize_t getValue(hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len);
    ssize_t notifyValue(hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool ack);
    int removeSubscriber(hal_ble_conn_handle_t connHandle);

    bool discovering(hal_ble_conn_handle_t connHandle) const;
    int discoverServices(hal_ble_conn_handle_t connHandle, const hal_ble_uuid_t* uuid, hal_ble_on_disc_service_cb_t callback, void* context);
    int discoverCharacteristics(hal_ble_conn_handle_t connHandle, const hal_ble_svc_t* service, const hal_ble_uuid_t* uuid, hal_ble_on_disc_char_cb_t callback, void* context);
    int configureRemoteCCCD(const hal_ble_cccd_config_t* config);
    ssize_t writeAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, const uint8_t* buf, size_t len, bool response);
    ssize_t readAttribute(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t attrHandle, uint8_t* buf, size_t len);

    int setDesiredAttMtu(size_t attMtu);

    bool registered() const {
        return serviceRegistered_;
    }

    Vector<BleService>& services() {
        return services_;
    }

    static BleGatt& getInstance() {
        static BleGatt instance;
        return instance;
    }

private:
    BleGatt()
            : serviceRegistered_(false),
              attrConfigured_(false),
              isNotifying_(false),
              notifySemaphore_(nullptr),
              isDiscovering_(false),
              currDiscConnHandle_(BLE_INVALID_CONN_HANDLE),
              currDiscService_(nullptr),
              discoverySemaphore_(nullptr),
              discSvcUuid_(nullptr),
              discSvcCallback_(nullptr),
              discSvcContext_(nullptr),
              discCharCallback_(nullptr),
              discCharContext_(nullptr),
              clientId_(CLIENT_PROFILE_GENERAL_ID),
              clientCallbacks_{},
              serverCallbacks_(),
              currReadConnHandle_(BLE_INVALID_CONN_HANDLE),
              readAttrHandle_(BLE_INVALID_ATTR_HANDLE),
              readBuf_(nullptr),
              readLen_(0),
              readSemaphore_(nullptr),
              currWriteConnHandle_(BLE_INVALID_CONN_HANDLE),
              writeAttrHandle_(BLE_INVALID_ATTR_HANDLE),
              writeSemaphore_(nullptr),
              desiredAttMtu_(BLE_MAX_ATT_MTU_SIZE) {
        clientCallbacks_.discover_state_cb = onDiscoverStateCallback;
        clientCallbacks_.discover_result_cb = onDiscoverResultCallback;
        clientCallbacks_.read_result_cb = onReadResultCallback;
        clientCallbacks_.write_result_cb = onWriteResultCallback;
        clientCallbacks_.notify_ind_result_cb = onNotifyIndResultCallback;
        clientCallbacks_.disconnect_cb = onGattClientDisconnectCallback;

        serverCallbacks_.read_attr_cb = gattReadAttrCallback;
        serverCallbacks_.write_attr_cb = gattWriteAttrCallback;
        serverCallbacks_.cccd_update_cb = gattCccdUpdatedCallback;

        resetDiscoveryState();
    }
    ~BleGatt() = default;

    struct Publisher {
        hal_ble_on_char_evt_cb_t callback;
        void* context;
        hal_ble_conn_handle_t connHandle;
        hal_ble_attr_handle_t valueHandle;
    };

    T_ATTRIB_APPL* findAttribute(hal_ble_attr_handle_t attrHandle) {
        for (auto& svc : services_) {
            if (attrHandle < svc.startHandle && attrHandle > svc.endHandle) {
                continue;
            }
            for (const auto& charact : svc.characteristics) {
                if (charact.handle != attrHandle) {
                    continue;
                }
                LOG_DEBUG(TRACE, "Found attr, id:%d, index:%d", svc.id, charact.index);
                return &svc.attrTable[charact.index];
            }
        }
        return nullptr;
    }

    void resetDiscoveryState();
    hal_ble_char_t* findDiscoveredCharacteristic(hal_ble_attr_handle_t attrHandle);
    int addPublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle, hal_ble_on_char_evt_cb_t callback, void* context);
    int removePublisher(hal_ble_conn_handle_t connHandle, hal_ble_attr_handle_t valueHandle);
    int removeAllPublishersOfConnection(hal_ble_conn_handle_t connHandle);

    static T_APP_RESULT gattServerEventCallback(T_SERVER_ID serviceId, void *pData);
    static T_APP_RESULT gattReadAttrCallback(uint8_t connHandle, T_SERVER_ID serviceId, uint16_t index, uint16_t offset, uint16_t *length, uint8_t **value);
    static T_APP_RESULT gattWriteAttrCallback(uint8_t connHandle, T_SERVER_ID serviceId, uint16_t index, T_WRITE_TYPE type, uint16_t length, uint8_t *value, P_FUN_WRITE_IND_POST_PROC *postProc);
    static void gattCccdUpdatedCallback(uint8_t connHandle, T_SERVER_ID serviceId, uint16_t index, uint16_t bits);

    static void onDiscoverStateCallback(uint8_t connHandle, T_DISCOVERY_STATE discoveryState);
    static void onDiscoverResultCallback(uint8_t connHandle, T_DISCOVERY_RESULT_TYPE type, T_DISCOVERY_RESULT_DATA data);
    static void onReadResultCallback(uint8_t connHandle, uint16_t cause, uint16_t handle, uint16_t size, uint8_t *value);
    static void onWriteResultCallback(uint8_t connHandle, T_GATT_WRITE_TYPE type, uint16_t handle, uint16_t cause, uint8_t credits);
    static T_APP_RESULT onNotifyIndResultCallback(uint8_t connHandle, bool notify, uint16_t handle, uint16_t size, uint8_t *value);
    static void onGattClientDisconnectCallback(uint8_t connHandle);

    bool serviceRegistered_;
    bool attrConfigured_;
    volatile bool isNotifying_;
    os_semaphore_t notifySemaphore_;                                /**< Semaphore to sync notify/indicate operation. */
    volatile bool isDiscovering_;                                   /**< If there is on-going discovery procedure. */
    hal_ble_conn_handle_t currDiscConnHandle_;                      /**< Current connection handle under which the service and characteristics to be discovered. */
    const hal_ble_svc_t* currDiscService_;                          /**< Used for discovering descriptors */
    os_semaphore_t discoverySemaphore_;                             /**< Semaphore to wait until the discovery procedure completed. */
    const hal_ble_uuid_t* discSvcUuid_;                             /**< Used only when discover service by UUID. */
    hal_ble_on_disc_service_cb_t discSvcCallback_;                  /**< Callback function on services discovered. */
    void* discSvcContext_;                                          /**< Context of services discovered callback function. */
    hal_ble_on_disc_char_cb_t discCharCallback_;                    /**< Callback function on characteristics discovered. */
    void* discCharContext_;                                         /**< Context of characteristics discovered callback function. */
    Vector<hal_ble_svc_t> discServices_;                            /**< Discover services. */
    Vector<hal_ble_char_t> discCharacteristics_;                    /**< Discovered characteristics. */
    T_CLIENT_ID clientId_;
    T_FUN_CLIENT_CBS clientCallbacks_;
    T_FUN_GATT_SERVICE_CBS serverCallbacks_;
    hal_ble_conn_handle_t currReadConnHandle_;
    hal_ble_attr_handle_t readAttrHandle_;                          /**< Current handle of which attribute to be read. */
    uint8_t* readBuf_;                                              /**< Current buffer to be filled for the read data. */
    size_t readLen_;                                                /**< Length of read data. */
    os_semaphore_t readSemaphore_;                                  /**< Semaphore to wait until the read operation completed. */
    hal_ble_conn_handle_t currWriteConnHandle_;
    hal_ble_attr_handle_t writeAttrHandle_;                          /**< Current handle of which attribute to be read. */
    os_semaphore_t writeSemaphore_;                                 /**< Semaphore to wait until the write operation completed. */
    size_t desiredAttMtu_;
    Vector<BleService> services_;
    Vector<Publisher> publishers_;
    static constexpr uint8_t MAX_ALLOWED_BLE_SERVICES = 5;
    static constexpr uint16_t CUSTOMER_SERVICE_START_HANDLE = 30;
    static constexpr uint8_t SERVICE_HANDLE_RANGE_RESERVED = 20;
};

