particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
int BleEventDispatcher::start() {
    if (started_) {
        // Already running
        return SYSTEM_ERROR_NONE;
    }
    SCOPE_GUARD({
        if (!started_) {
            cleanup();
        }
    });
    if (!ioEvtQueue_) {
        CHECK_TRUE(os_msg_queue_create(&ioEvtQueue_, MAX_NUMBER_OF_IO_MESSAGE, sizeof(T_IO_MSG)), SYSTEM_ERROR_INTERNAL);
    }
    if (!allEvtQueue_) {
        CHECK_TRUE(os_msg_queue_create(&allEvtQueue_, MAX_NUMBER_OF_EVENT_MESSAGE, sizeof(uint8_t)), SYSTEM_ERROR_INTERNAL);
    }
    if (!thread_) {
        CHECK_TRUE(os_thread_create(&thread_, "bleEvtThread", BLE_EVENT_THREAD_PRIORITY, bleEventDispatchThread, this, BLE_EVENT_THREAD_STACK_SIZE) == 0, SYSTEM_ERROR_INTERNAL);
    }
    CHECK_TRUE(gap_start_bt_stack(allEvtQueue_, ioEvtQueue_, MAX_NUMBER_OF_GAP_MESSAGE), SYSTEM_ERROR_INTERNAL);
    started_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleEventDispatcher::stop() {
    cleanup();
    started_ = false;
    return SYSTEM_ERROR_NONE;
}

void BleEventDispatcher::cleanup() {
    if (thread_ && allEvtQueue_ && !isThreadCurrent()) {
        uint8_t ev = BLE_EVENT_STOP;
        SPARK_ASSERT(os_msg_send(allEvtQueue_, &ev, BLE_ENQUEUE_TIMEOUT_MS));
        os_thread_join(thread_);
        thread_ = nullptr;
    }
    if (allEvtQueue_) {
        if (!thread_) {
            os_msg_queue_delete(allEvtQueue_);
            allEvtQueue_ = nullptr;
        } else {
            uint8_t event;
            while (os_msg_recv(allEvtQueue_, &event, 0) == true) {}
        }
    }
    if (ioEvtQueue_) {
        if (!thread_) {
            os_msg_queue_delete(ioEvtQueue_);
            ioEvtQueue_ = nullptr;
        } else {
            T_IO_MSG message;
            while (os_msg_recv(ioEvtQueue_, &message, 0) == true) {}
        }
    }
}

void BleEventDispatcher::handleIoMessage(T_IO_MSG message) const {
    switch (message.type) {
        case IO_MSG_TYPE_BT_STATUS: {
            T_LE_GAP_MSG gap_msg;
            memcpy(&gap_msg, &message.u.param, sizeof(message.u.param));
            switch (message.subtype) {
                case GAP_MSG_LE_DEV_STATE_CHANGE: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_DEV_STATE_CHANGE");
                    const auto& devStateChange = gap_msg.msg_data.gap_dev_state_change;
                    BleGap::getInstance().handleDevStateChanged(devStateChange.new_state, devStateChange.cause);
                    break;
                }
                case GAP_MSG_LE_CONN_STATE_CHANGE: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_CONN_STATE_CHANGE");
                    const auto& connStateChange = gap_msg.msg_data.gap_conn_state_change;
                    BleGap::getInstance().handleConnectionStateChanged(connStateChange.conn_id, (T_GAP_CONN_STATE)connStateChange.new_state, connStateChange.disc_cause);
                    break;
                }
                case GAP_MSG_LE_CONN_MTU_INFO: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_CONN_MTU_INFO");
                    const auto& mtuUpdated = gap_msg.msg_data.gap_conn_mtu_info;
                    BleGap::getInstance().handleMtuUpdated(mtuUpdated.conn_id, mtuUpdated.mtu_size);
                    break;
                }
                case GAP_MSG_LE_CONN_PARAM_UPDATE: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_CONN_PARAM_UPDATE");
                    const auto& connParamsUpdated = gap_msg.msg_data.gap_conn_param_update;
                    BleGap::getInstance().handleConnParamsUpdated(connParamsUpdated.conn_id, connParamsUpdated.status, connParamsUpdated.cause);
                    break;
                }
                case GAP_MSG_LE_AUTHEN_STATE_CHANGE: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_AUTHEN_STATE_CHANGE");
                    const auto& authenStateChanged = gap_msg.msg_data.gap_authen_state;
                    BleGap::getInstance().handleAuthenStateChanged(authenStateChanged.conn_id, authenStateChanged.new_state, authenStateChanged.status);
                    break;
                }
                case GAP_MSG_LE_BOND_JUST_WORK: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_BOND_JUST_WORK");
                    const auto& pairJustWork = gap_msg.msg_data.gap_bond_just_work_conf;
                    BleGap::getInstance().handlePairJustWork(pairJustWork.conn_id);
                    break;
                }
                case GAP_MSG_LE_BOND_PASSKEY_DISPLAY: {
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_BOND_PASSKEY_DISPLAY");
                    auto& passkeyDisplay = gap_msg.msg_data.gap_bond_passkey_display;
                    BleGap::getInstance().handlePairPasskeyDisplay(passkeyDisplay.conn_id);
                    break;
                }
                case GAP_MSG_LE_BOND_USER_CONFIRMATION: {
                    // Numeric comparison
                    LOG_DEBUG(TRACE, "handleIoMessage, GAP_MSG_LE_BOND_USER_CONFIRMATION");
                    auto& numericComparison = gap_msg.msg_data.gap_bond_user_conf;
                    BleGap::getInstance().handlePairPasskeyDisplay(numericComparison.conn_id, false);
                    break;
                }
                case GAP_MSG_LE_BOND_PASSKEY_INPUT: {
                    LOG_DEBUG(TRACE, "handleIoMessage: GAP_MSG_LE_BOND_PASSKEY_INPUT");
                    auto& passkeyInput = gap_msg.msg_data.gap_bond_passkey_input;
                    BleGap::getInstance().handlePairPasskeyInput(passkeyInput.conn_id);
                    break;
                }
                default: {
                    LOG_DEBUG(TRACE, "handleIoMessage: unknown subtype %d", message.subtype);
                    break;
                }
            }
            break;
        }
        case IO_MSG_TYPE_AT_CMD: {
            LOG_DEBUG(TRACE, "handleIoMessage: IO_MSG_TYPE_AT_CMD");
            break;
        }
        case IO_MSG_TYPE_QDECODE: {
            LOG_DEBUG(TRACE, "handleIoMessage: IO_MSG_TYPE_QDECODE");
            break;
        }
        default: break;
    }
}

