particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
void BleEventDispatcher::bleEventDispatchThread(void *context) {
    BleEventDispatcher* dispatcher = (BleEventDispatcher*)context;
    while (true) {
        uint8_t event;
        if (os_msg_recv(dispatcher->allEvtQueue_, &event, 0xFFFFFFFF) == true) {
            std::lock_guard<StaticRecursiveMutex> lk(sBleEventMutex);
            if (event == EVENT_IO_TO_APP) {
                T_IO_MSG message;
                if (os_msg_recv(dispatcher->ioEvtQueue_, &message, 0) == true) {
                    // Handled by application directly
                    dispatcher->handleIoMessage(message);
                }
            } else if (event == BLE_EVENT_STOP) {
                break;
            } else {
                // Handled by BT lib, which will finally invoke the registered callback.
                // Do not do time consuming stuff in the callbacks.
                gap_handle_msg(event);
            }
        }
    }
    os_thread_exit(nullptr);
}

void BleGap::bleCommandThread(void *context) {
    BleGap* gap = (BleGap*)context;
    Command command = {};
    while (true) {
        bool locked = false;
        if (!os_queue_peek(gap->cmdQueue_, &command, CONCURRENT_WAIT_FOREVER, nullptr)) {
            LOCAL_DEBUG("---> Enter ble cmd thread, cmd: %d", command.cmd);
            if (command.cmd == BLE_CMD_STOP_ADV || command.cmd == BLE_CMD_STOP_ADV_NOTIFY) {
                if (gap->isAdvertising()) {
                    LOCAL_DEBUG( "stopAdvertising in ble cmd thread");
                    // FIXME: duplication, but for now works as a workaround
                    while (!(locked = s_bleMutex.lock(BLE_WAIT_CMD_THREAD_TRY_LOCK)) && !gap->bleCommandThreadExit_) {
                        // Nothing
                    }
                    SCOPE_GUARD({
                        if (locked) {
                            s_bleMutex.unlock();
                        }
                    });
                    if (gap->bleCommandThreadExit_) {
                        LOCAL_DEBUG("Exit ble cmd thread");
                        break;
                    }
                    gap->stopAdvertising();
                    LOCAL_DEBUG("notifyAdvStop in ble cmd thread");
                    if (command.cmd == BLE_CMD_STOP_ADV_NOTIFY) {
                        gap->notifyAdvStop();
                    }
                }
            } else if (command.cmd == BLE_CMD_START_ADV) {
                LOCAL_DEBUG("startAdvertising in ble cmd thread");
                // FIXME: duplication, but for now works as a workaround
                while (!(locked = s_bleMutex.lock(BLE_WAIT_CMD_THREAD_TRY_LOCK)) && !gap->bleCommandThreadExit_) {
                    // Nothing
                }
                SCOPE_GUARD({
                    if (locked) {
                        s_bleMutex.unlock();
                    }
                });
                if (gap->bleCommandThreadExit_) {
                    LOCAL_DEBUG("Exit ble cmd thread");
                    break;
                }
                gap->startAdvertising();
            } else if (command.cmd == BLE_CMD_MTU_EXCHANGE_TIMEOUT) {
                gap->handleMtuUpdated((uint8_t)(uintptr_t)command.arg /* connHandle */, 0);
            } else if (command.cmd == BLE_CMD_EXIT_THREAD) {
                LOCAL_DEBUG("Exit ble cmd thread");
                break;
            }
            LOCAL_DEBUG("<--- ble cmd %d executed", command);
            os_queue_take(gap->cmdQueue_, &command, 0, nullptr);
        }
    }
    // Just in case clean up the queue on exit
    while (!os_queue_take(gap->cmdQueue_, &command, 0, nullptr));
    os_thread_exit(nullptr);
}

int BleGap::init() {
    if (initialized_) {
        return SYSTEM_ERROR_NONE;
    }
    rtwRadioAcquire(RTW_RADIO_BLE);
    state_.raw = 0;

    SCOPE_GUARD({
        if (!initialized_) {
            stop();
        }
    });

    RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART1_CLOCK, ENABLE);

    if (!cmdQueue_) {
        CHECK_TRUE(os_queue_create(&cmdQueue_, sizeof(Command), BLE_CMD_QUEUE_SIZE, nullptr) == 0, SYSTEM_ERROR_INTERNAL);
    }
    if (!cmdThread_) {
        CHECK_TRUE(os_thread_create(&cmdThread_, "bleCommandThread", BLE_CMD_THREAD_PRIORITY, bleCommandThread, this, BLE_CMD_THREAD_STACK_SIZE) == 0, SYSTEM_ERROR_INTERNAL);
    }
    CHECK_TRUE(os_semaphore_create(&scanSemaphore_, 1, 0) == 0, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(os_semaphore_create(&stateSemaphore_, 1, 0) == 0, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(os_semaphore_create(&connectSemaphore_, 1, 0) == 0, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(os_semaphore_create(&disconnectSemaphore_, 1, 0) == 0, SYSTEM_ERROR_INTERNAL);
    // FreeRTOS timers are not supposed to be created with 0 timeout, enabling configASSERT will trigger it
    // We're just creating the timer with fixed period and we're going to change it anyway before starting advertising.
    CHECK_TRUE(os_timer_create(&advTimeoutTimer_, 1000, onAdvTimeoutTimerExpired, this, true, nullptr) == 0, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(os_timer_create(&attMtuExchangeTimer_, BLE_ATT_MTU_EXCHANGE_TIMEOUT_MS, onAttMtuExchangeTimerExpired, nullptr, true, nullptr) == 0, SYSTEM_ERROR_NO_MEMORY);

    gap_config_max_le_link_num(BLE_MAX_LINK_COUNT);
    gap_config_max_le_paired_device(BLE_MAX_LINK_COUNT);

    CHECK_TRUE(bte_init(), SYSTEM_ERROR_INTERNAL);

    CHECK_TRUE(le_gap_init(BLE_MAX_LINK_COUNT), SYSTEM_ERROR_INTERNAL);
    uint8_t mtuReq = true;
    CHECK_RTL(le_set_gap_param(GAP_PARAM_SLAVE_INIT_GATT_MTU_REQ, sizeof(mtuReq), &mtuReq));
    // XXX: MTU exchange is broken in Central role if initiated by us and the remote peripheral
    // does not respond to the request (which is the case with some Apple devices (of course))
    // Because we do not get any response, the rest of the requests (write/read/discovery)
    // are not executed and we are stuck in a connected state without being able to communicate
    // with the peripheral. Disabling GAP_PARAM_MASTER_INIT_GATT_MTU_REQ seems to work and allows
    // us to rely solely on the peripheral to perform MTU exchange.
    mtuReq = false;
    CHECK_RTL(le_set_gap_param(GAP_PARAM_MASTER_INIT_GATT_MTU_REQ, sizeof(mtuReq), &mtuReq));
    CHECK(setAppearance(GAP_GATT_APPEARANCE_UNKNOWN));
    CHECK(setDeviceName(devName_, devNameLen_));
    CHECK(setAdvertisingParameters(&advParams_));
    CHECK(setScanParams(&scanParams_));

    constexpr uint8_t zeros[BLE_SIG_ADDR_LEN] = {0,0,0,0,0,0};
    if (!memcmp(addr_.addr, zeros, BLE_SIG_ADDR_LEN)) {
        CHECK(setDeviceAddress(nullptr));
    } else {
        CHECK(setDeviceAddress(&addr_));
    }

