particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
    uint8_t pairable = GAP_PAIRING_MODE_PAIRABLE;
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_PAIRING_MODE, sizeof(pairable), &pairable));
    // Bit mask: GAP_AUTHEN_BIT_BONDING_FLAG, GAP_AUTHEN_BIT_MITM_FLAG, GAP_AUTHEN_BIT_SC_FLAG
    uint16_t authFlags = 0;
    if (pairingConfig_.algorithm == BLE_PAIRING_ALGORITHM_AUTO) {
        // Prefer LESC
        authFlags = GAP_AUTHEN_BIT_SC_FLAG;
    } else if (pairingConfig_.algorithm == BLE_PAIRING_ALGORITHM_LESC_ONLY) {
        authFlags = GAP_AUTHEN_BIT_SC_ONLY_FLAG | GAP_AUTHEN_BIT_SC_FLAG;
    }
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_AUTHEN_REQUIREMENTS_FLAGS, sizeof(authFlags), &authFlags));
    // IO Capabilities
    uint8_t ioCaps = toPlatformIoCaps(pairingConfig_.io_caps);
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_IO_CAPABILITIES, sizeof(ioCaps), &ioCaps));
    // Send smp security request automatically when connected
    uint8_t secReq = false;
    CHECK_RTL(le_bond_set_param(GAP_PARAM_BOND_SEC_REQ_ENABLE, sizeof(secReq), &secReq));
    uint16_t secReqFlags = authFlags;
    if (pairingConfig_.io_caps != BLE_IO_CAPS_NONE) {
        secReqFlags |= GAP_AUTHEN_BIT_MITM_FLAG;
    }
    CHECK_RTL(le_bond_set_param(GAP_PARAM_BOND_SEC_REQ_REQUIREMENT, sizeof(secReqFlags), &secReqFlags));
    CHECK_RTL(gap_set_pairable_mode());

    /* register gap message callback */
    le_register_app_cb(gapEventCallback);

    CHECK(BleGatt::getInstance().init());

    initialized_ = true;
    return SYSTEM_ERROR_NONE;
}

int BleGap::start() {
    if (btStackStarted_) {
        return SYSTEM_ERROR_NONE;
    }

    CHECK(init());

    SCOPE_GUARD({
        if (!btStackStarted_) {
            // FIXME: if adv/scan/conn is active, we should try to restore the state
            stop(false);
        }
    });

    bt_coex_init();

    // NOTE: we will miss some of the initial events between bte_init() and when we start the event dispatcher
    CHECK(BleEventDispatcher::getInstance().start());
    // NOTE: we have to wait for the BLE stack to get initialized otherwise other operations
    // with it may cause race conditions, memory leaks and other problems
    LOCAL_DEBUG("wait GAP_INIT_STATE_STACK_READY");
    CHECK(waitState(BleGapDevState().init(GAP_INIT_STATE_STACK_READY), BLE_STATE_DEFAULT_TIMEOUT, true /* force poll */));
    btStackStarted_ = true;
    wifi_btcoex_set_bt_on();

    if (cache_.isAdv || cache_.isConn) {
        LOG(TRACE, "Restore advertising state");
        startAdvertising(); // Despite of the result.
    }
    // FIXME: Scann state cannot be restored, as it is a blocking call for now
    // if (cache_.isScan) {
    //     LOG(TRACE, "Restore scanning state");
    //     startScanning(); // Despite of the result.
    // }
    return SYSTEM_ERROR_NONE;
}

int BleGap::stop(bool restore) {
    LOG(TRACE, "Going to stop the stack...");
    if (restore) {
        cache_.isAdv = isAdvertising_;
        cache_.isScan = isScanning_;
        cache_.isConn = connectedAsBlePeripheral();
    } else {
        cache_ = {};
    }
    // NOTE: ignoring errors
    if (btStackStarted_) {
        // Abort any commands, e.g. the re-adv command after disconnection.
        if (cmdThread_ && !os_thread_is_current(cmdThread_)) {
            bleCommandThreadExit_ = true;
            // It's fine even if this call below fails, but just in case loop here
            while (enqueue(BLE_CMD_EXIT_THREAD)) {
                // Nothing
            }
            os_thread_join(cmdThread_);
            cmdThread_ = nullptr;
            bleCommandThreadExit_ = false;
        }
        if (cmdQueue_) {
            if (!cmdThread_) {
                os_queue_destroy(cmdQueue_, nullptr);
                cmdQueue_ = nullptr;
            } else {
                Command command = {};
                while (!os_queue_take(cmdQueue_, &command, 0, nullptr)) {}
            }
        }

        // NOTE: we have to wait for the BLE stack to get initialized otherwise other operations
        // with it may cause race conditions, memory leaks and other problems
        LOCAL_DEBUG("wait GAP_INIT_STATE_STACK_READY in stop()");
        waitState(BleGapDevState().init(GAP_INIT_STATE_STACK_READY), BLE_STATE_DEFAULT_TIMEOUT, true /* force poll */);
        disconnectAll();
        if (isAdvertising_) {
            // This will also wait for advertisements to stop
            stopAdvertising();
        }

        if (isScanning_) {
            stopScanning();
            WRAP_BLE_EVT_LOCK(le_scan_stop()); // Just in case
        }

        // Prevent BLE stack from generating coexistence events, otherwise we may leak memory
        gap_register_vendor_cb([](uint8_t cb_type, void *p_cb_data) -> void {
        });
        {
            rtwCoexStop();
        }
    }
    bte_deinit();
    // This shoulld be called after BT stack is stopped so that BLE events in queue can be safely cleared.
    BleEventDispatcher::getInstance().stop();

    isAdvertising_ = false;
    isScanning_ = false;
    initialized_ = false;
    btStackStarted_ = false;

    if (scanSemaphore_) {
        os_semaphore_destroy(scanSemaphore_);
        scanSemaphore_ = nullptr;
    }
    if (stateSemaphore_) {
        os_semaphore_destroy(stateSemaphore_);
        stateSemaphore_ = nullptr;
    }
    if (connectSemaphore_) {
        os_semaphore_destroy(connectSemaphore_);
        connectSemaphore_ = nullptr;
    }
    if (disconnectSemaphore_) {
        os_semaphore_destroy(disconnectSemaphore_);
        disconnectSemaphore_ = nullptr;
    }
    if (advTimeoutTimer_) {
        os_timer_destroy(advTimeoutTimer_, nullptr);
        advTimeoutTimer_ = nullptr;
    }
    if (attMtuExchangeTimer_) {
        os_timer_destroy(attMtuExchangeTimer_, nullptr);
        attMtuExchangeTimer_ = nullptr;
    }

    BleGatt::getInstance().deinit();

    RCC_PeriphClockCmd(APBPeriph_UART1, APBPeriph_UART1_CLOCK, DISABLE);
    rtwRadioRelease(RTW_RADIO_BLE);
    return SYSTEM_ERROR_NONE;
}

int BleGap::setAppearance(uint16_t appearance) const {
    CHECK_RTL(le_set_gap_param(GAP_PARAM_APPEARANCE, sizeof(appearance), &appearance));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setDeviceName(const char* deviceName, size_t len) {
    if (deviceName == nullptr || len == 0) {
        size_t len = CHECK(get_device_name(devName_, sizeof(devName_))); // null-terminated
        devNameLen_ = std::min(len, sizeof(devName_) - 1);
    } else {
        devNameLen_ = std::min(len, sizeof(devName_) - 1);
        memcpy(devName_, deviceName, devNameLen_);
        devName_[devNameLen_] = '\0';
    }
    CHECK_RTL(le_set_gap_param(GAP_PARAM_DEVICE_NAME, std::min(BLE_MAX_DEV_NAME_LEN, (int)devNameLen_), (void*)devName_));
    return SYSTEM_ERROR_NONE;
}

