particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
    CHECK(start());
    isAdvertising_ = true; // Set it to true here, because stop() will be called if attribute table is not registered yet.

    SCOPE_GUARD ({
        // NOTE: this will run first before the other SCOPE_GUARD, make sure to look at 'ok' state as well
        if ((!isAdvertising() || !ok) && os_timer_is_active(advTimeoutTimer_, nullptr)) {
            os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_STOP, hal_interrupt_is_isr() ? true : false, 0, 0, nullptr);
        }
    });
    if (advParams_.timeout != 0) { // 0 for advertising infinitely
        if (os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_PERIOD, hal_interrupt_is_isr() ? true : false, advParams_.timeout * 10 + BLE_ADV_TIMEOUT_EXT_MS, 0, nullptr)) {
            LOG(ERROR, "Failed to start timer.");
            return SYSTEM_ERROR_INTERNAL;
        }
    }

    uint8_t advEvtType = toPlatformAdvEvtType(advParams_.type);
    if (connectedAsBlePeripheral()) {
        advEvtType = GAP_ADTYPE_ADV_SCAN_IND;
    }
    CHECK_RTL(le_adv_set_param(GAP_PARAM_ADV_EVENT_TYPE, sizeof(advEvtType), &advEvtType));

    CHECK_RTL(WRAP_BLE_EVT_LOCK(le_adv_start()));

    if (wait) {
        LOG_DEBUG(TRACE, "Starting advertising...");
        if (waitState(BleGapDevState().adv(GAP_ADV_STATE_ADVERTISING))) {
            LOG(ERROR, "Failed to get notified that advertising has started");
        }
    }
    ok = true;
    LOG_DEBUG(TRACE, "Advertising started");
    return SYSTEM_ERROR_NONE;
}

int BleGap::stopAdvertising(bool wait) {
    if (wait) {
        if (BleEventDispatcher::getInstance().isThreadCurrent()) {
            // Can't block event processing thread
            wait = false;
        }
    }
    if (!isAdvertising_) {
        return SYSTEM_ERROR_NONE;
    }
    // In case of invoking startAdvertising(false) previously
    // Update: now we use BLE command queue to make sure adv state is correctly set
    // if (wait && state_.state.gap_adv_state != GAP_ADV_STATE_ADVERTISING) {
    //     if (waitState(BleGapDevState().adv(GAP_ADV_STATE_ADVERTISING), BLE_STATE_DEFAULT_TIMEOUT, true)) {
    //         LOG(ERROR, "Failed to get notified that advertising has started");
    //     }
    // }
    isAdvertising_ = false;
    CHECK_RTL(WRAP_BLE_EVT_LOCK(le_adv_stop()));
    if (os_timer_is_active(advTimeoutTimer_, nullptr)) {
        os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_STOP, hal_interrupt_is_isr() ? true : false, 0, 0, nullptr);
    }
    if (wait) {
        LOG_DEBUG(TRACE, "Stopping advertising...");
        if (waitState(BleGapDevState().adv(GAP_ADV_STATE_IDLE))) {
            LOG(ERROR, "Failed to get notified that advertising has stopped");
        }
    }
    LOG_DEBUG(TRACE, "Advertising stopped");
    return SYSTEM_ERROR_NONE;
}

int BleGap::notifyAdvStop() {
    hal_ble_adv_evt_t advEvent = {};
    advEvent.type = BLE_EVT_ADV_STOPPED;
    advEvent.params.reason = BLE_ADV_STOPPED_REASON_TIMEOUT;
    std::lock_guard<Mutex> lk(advEventMutex_);
    for (const auto& handler : advEventHandlers_) {
        if (handler.callback) {
            handler.callback(&advEvent, handler.context);
        }
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::setAutoAdvertiseScheme(hal_ble_auto_adv_cfg_t config) {
    autoAdvCfg_ = config;
    bool connectedAsPeripheral = false;
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    for (auto& connection : connections_) {
        if (connection.info.role == BLE_ROLE_PERIPHERAL) {
            connectedAsPeripheral = true;
            break;
        }
    }
    if (!connectedAsPeripheral && autoAdvCfg_ == BLE_AUTO_ADV_SINCE_NEXT_CONN) {
        // If it is not connected as Peripheral currently.
        autoAdvCfg_ = BLE_AUTO_ADV_ALWAYS;
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::getAutoAdvertiseScheme(hal_ble_auto_adv_cfg_t* cfg) {
    *cfg = autoAdvCfg_;
    return SYSTEM_ERROR_NONE;
}

void BleGap::onAdvTimeoutTimerExpired(os_timer_t timer) {
    BleGap* gap;
    os_timer_get_id(timer, (void**)&gap);
    gap->enqueue(BLE_CMD_STOP_ADV_NOTIFY);
}

void BleGap::onAttMtuExchangeTimerExpired(os_timer_t timer) {
    void* timerId = nullptr;
    os_timer_get_id(timer, &timerId); // This is connHandle
    BleGap::getInstance().enqueue(BLE_CMD_MTU_EXCHANGE_TIMEOUT, timerId);
}

bool BleGap::scanning() {
    return isScanning_;
}

int BleGap::setScanParams(const hal_ble_scan_params_t* params) {
    CHECK_TRUE(params, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->interval >= BLE_SCAN_INTERVAL_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->interval <= BLE_SCAN_INTERVAL_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->window >= BLE_SCAN_WINDOW_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->window <= BLE_SCAN_WINDOW_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(params->window <= params->interval, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(&scanParams_, params, std::min(scanParams_.size, params->size));
    scanParams_.size = sizeof(hal_ble_scan_params_t);
    scanParams_.version = BLE_API_VERSION;
    uint8_t filterDuplicate = GAP_SCAN_FILTER_DUPLICATE_DISABLE;
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_MODE, sizeof(uint8_t), &scanParams_.active));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_INTERVAL, sizeof(uint16_t), &scanParams_.interval));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_WINDOW, sizeof(uint16_t), &scanParams_.window));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_FILTER_POLICY, sizeof(uint8_t), &scanParams_.filter_policy));
    CHECK_RTL(le_scan_set_param(GAP_PARAM_SCAN_FILTER_DUPLICATES, sizeof(uint8_t), &filterDuplicate));
    return SYSTEM_ERROR_NONE;
}

int BleGap::getScanParams(hal_ble_scan_params_t* params) const {
    CHECK_TRUE(params, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(params, &scanParams_, std::min(scanParams_.size, params->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::startScanning(hal_ble_on_scan_result_cb_t callback, void* context) {
    BleLock lk;

    CHECK(start());
    CHECK_FALSE(isScanning_, SYSTEM_ERROR_INVALID_STATE);
    bool resetStack = false;

    NAMED_SCOPE_GUARD(sg, {
        stopScanning(resetStack);
    });
    scanResultCallback_ = callback;
    context_ = context;

    // Just in case
    os_semaphore_take(scanSemaphore_, 0, false);

