particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
    CHECK_RTL(WRAP_BLE_EVT_LOCK(le_scan_start()));
    isScanning_ = true;
    notifyScanResult_ = true;
    // GAP_SCAN_STATE_SCANNING may be propagated immediately following the GAP_SCAN_STATE_START
    // IMPORTANT: have to poll here, for some reason we may not get notified
    if (waitState(BleGapDevState().scan(GAP_SCAN_STATE_SCANNING), BLE_STATE_DEFAULT_TIMEOUT, true /* forcePoll */)) {
        RtlGapDevState s;
        le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state);
        LOG(TRACE, "Failed to start scanning scan state=%d", s.state.gap_scan_state);
        // The stack state is messed up, we need to reset the stack.
        isScanning_ = false;
        resetStack = true;
        return SYSTEM_ERROR_TIMEOUT;
    }
    // We unlock BLE lock here though so that other BLE APIs are accessible while we are performing a scan.
    // Especially if it's a continuous scan.
    lk.unlock();
    // To be consistent with Gen3, the scan proceedure is blocked for now,
    // so we can simply wait for the semaphore to be given without introducing a dedicated timer.
    os_semaphore_take(scanSemaphore_, (scanParams_.timeout == BLE_SCAN_TIMEOUT_UNLIMITED) ? CONCURRENT_WAIT_FOREVER : (scanParams_.timeout * 10), false);
    return SYSTEM_ERROR_NONE;
}

int BleGap::stopScanning(bool resetStack) {
    BleLock lk;
    notifyScanResult_ = false;
    if (!isScanning_) {
        return SYSTEM_ERROR_NONE;
    }

    if (BleEventDispatcher::getInstance().isThreadCurrent()) {
        // Can't stop scanning properly from event processing thread
        // Unblock the caller of scan() and perform stopScanning()
        // in there.
        // XXX: It's not safe to call le_scan_stop() especially
        // from inside the ble scan result callback! 
        os_semaphore_give(scanSemaphore_, false);
        return 0;
    }

    const int LE_SCAN_STOP_RETRIES = 1;
    for (int i = 0; i < LE_SCAN_STOP_RETRIES; i++) {
        // This has seen failing a number of times at least
        // with btgap logging enabled. Retry a few times just in case,
        // otherwise the next scan operation fails with invalid state.
        auto r = WRAP_BLE_EVT_LOCK(le_scan_stop());
        if (r == GAP_CAUSE_SUCCESS) {
            // IMPORTANT: have to poll here, for some reason we may not get notified
            if (!waitState(BleGapDevState().scan(GAP_SCAN_STATE_IDLE), BLE_STATE_DEFAULT_TIMEOUT, true /* forcePoll */)) {
                isScanning_ = false;
            }
            break;
        }
        HAL_Delay_Milliseconds(10);
    }

    if (isScanning_) {
        // Verified that if the scan state is GAP_SCAN_STATE_STOP, instead of GAP_SCAN_STATE_IDLE,
        // the next scan operation will fail with invalid state.
        RtlGapDevState s;
        le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state);
        LOG(TRACE, "Failed to stop scanning, resetting stack, scan state=%d", s.state.gap_scan_state);
        resetStack = true;
    }

    if (resetStack) {
        int ret = stop();
        SPARK_ASSERT(ret == SYSTEM_ERROR_NONE);
        clearPendingResult();
        ret = init();
        SPARK_ASSERT(ret == SYSTEM_ERROR_NONE);
        ret = start();
        SPARK_ASSERT(ret == SYSTEM_ERROR_NONE);
    } else {
        clearPendingResult();
    }

    // Just in case
    os_semaphore_give(scanSemaphore_, false);

    return SYSTEM_ERROR_NONE;
}

// This function is called from thread
void BleGap::notifyScanResult(T_LE_SCAN_INFO* advReport) {
    if (!isScanning_ || !scanResultCallback_ || !notifyScanResult_) {
        return;
    }

    hal_ble_addr_t newAddr = {};
    newAddr.addr_type = (ble_sig_addr_type_t)advReport->remote_addr_type;
    memcpy(newAddr.addr, advReport->bd_addr, BLE_SIG_ADDR_LEN);

    hal_ble_scan_result_evt_t* pendingResult = getPendingResult(newAddr);
    if (advReport->adv_type != GAP_ADV_EVT_TYPE_SCAN_RSP) {
        if (pendingResult || advReport->data_len < 3) { // The advertising data should at least contains AD flag (len + type + AD flag)
            // Repeated adv packet
            return;
        }
        hal_ble_scan_result_evt_t result = {};
        result.rssi = advReport->rssi;
        if ((advReport->adv_type == GAP_ADV_EVT_TYPE_UNDIRECTED) || (advReport->adv_type == GAP_ADV_EVT_TYPE_DIRECTED)) {
            result.type.connectable = true;
            result.type.scannable = true;
        } else {
            result.type.connectable = false;
            result.type.scannable = false;
        }
        if (advReport->adv_type == GAP_ADV_EVT_TYPE_SCANNABLE) {
            result.type.scannable = true;
        }
        if (advReport->adv_type == GAP_ADV_EVT_TYPE_DIRECTED) {
            result.type.directed = true;
        } else {
            result.type.directed = false;
        }
        result.type.extended_pdu = false;
        result.peer_addr = newAddr;
        result.adv_data_len = advReport->data_len;
        result.adv_data = advReport->data;
        if (!scanParams_.active || !result.type.scannable) {
            // No scan response data is expected.
            scanResultCallback_(&result, context_);
            return;
        }
        uint8_t* advData = (uint8_t*)malloc(result.adv_data_len);
        if (!advData) {
            return;
        }
        memcpy(advData, result.adv_data, result.adv_data_len);
        result.adv_data = advData;
        if (addPendingResult(result) != SYSTEM_ERROR_NONE) {
            free(advData);
        }
    } else {
        if (!pendingResult) {
            // We received the scan response data, but the advertising data should come first. Abort it.
            return;
        }
        pendingResult->sr_data_len = advReport->data_len;
        pendingResult->sr_data = advReport->data;
        scanResultCallback_(pendingResult, context_);
        removePendingResult(newAddr);
    }
}

hal_ble_scan_result_evt_t* BleGap::getPendingResult(const hal_ble_addr_t& address) {
    for (auto& result : pendingResults_) {
        if (addressEqual(result.peer_addr, address)) {
            return &result;
        }
    }
    return nullptr;
}

int BleGap::addPendingResult(const hal_ble_scan_result_evt_t& result) {
    if (getPendingResult(result.peer_addr) != nullptr) {
        return SYSTEM_ERROR_INTERNAL;
    }
    CHECK_TRUE(pendingResults_.append(result), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleGap::removePendingResult(const hal_ble_addr_t& address) {
    for (int i = 0; i < pendingResults_.size();) {
        if (addressEqual(pendingResults_[i].peer_addr, address)) {
            if (pendingResults_[i].adv_data) {
                free(pendingResults_[i].adv_data);
            }
            pendingResults_.removeAt(i);
            continue;
        }
        i++;
    }
}

void BleGap::clearPendingResult() {
    for (const auto& result : pendingResults_) {
        // Notify the pending results, in case that they are not expecting scan response data.
        // To be consistent with Gen3
        // scanResultCallback_(&result, context_);
        if (result.adv_data) {
            free(result.adv_data);
        }
    }
    pendingResults_.clear();
}

ssize_t BleGap::getAttMtu(hal_ble_conn_handle_t connHandle) {
    auto connection = peekConnection(connHandle);
    CHECK_TRUE(connection.valid(), SYSTEM_ERROR_NOT_FOUND);
    return connection.info.att_mtu;
}

int BleGap::getConnectionInfo(hal_ble_conn_handle_t connHandle, hal_ble_conn_info_t* info) {
    auto connection = peekConnection(connHandle);
    CHECK_TRUE(connection.valid(), SYSTEM_ERROR_NOT_FOUND);
    uint16_t size = std::min(connection.info.size, info->size);
    memcpy(info, &connection.info, size);
    return SYSTEM_ERROR_NONE;
}

int BleGap::setPpcp(const hal_ble_conn_params_t* ppcp) {
    CHECK_TRUE(ppcp, SYSTEM_ERROR_INVALID_ARGUMENT);
    if (ppcp->min_conn_interval != BLE_SIG_CP_MIN_CONN_INTERVAL_NONE) {
        CHECK_TRUE(ppcp->min_conn_interval >= BLE_SIG_CP_MIN_CONN_INTERVAL_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(ppcp->min_conn_interval <= BLE_SIG_CP_MIN_CONN_INTERVAL_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    }
    if (ppcp->max_conn_interval != BLE_SIG_CP_MAX_CONN_INTERVAL_NONE) {
        CHECK_TRUE(ppcp->max_conn_interval >= BLE_SIG_CP_MAX_CONN_INTERVAL_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(ppcp->max_conn_interval <= BLE_SIG_CP_MAX_CONN_INTERVAL_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    }
    CHECK_TRUE(ppcp->slave_latency < BLE_SIG_CP_SLAVE_LATENCY_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    if (ppcp->conn_sup_timeout != BLE_SIG_CP_CONN_SUP_TIMEOUT_NONE) {
        CHECK_TRUE(ppcp->conn_sup_timeout >= BLE_SIG_CP_CONN_SUP_TIMEOUT_MIN, SYSTEM_ERROR_INVALID_ARGUMENT);
        CHECK_TRUE(ppcp->conn_sup_timeout <= BLE_SIG_CP_CONN_SUP_TIMEOUT_MAX, SYSTEM_ERROR_INVALID_ARGUMENT);
    }
    memcpy(&ppcp_, ppcp, std::min(ppcp_.size, ppcp->size));
    return SYSTEM_ERROR_NONE;
}

