particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
int BleGap::getPpcp(hal_ble_conn_params_t* ppcp) const {
    CHECK_TRUE(ppcp, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(ppcp, &ppcp_, std::min(ppcp_.size, ppcp->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::connect(const hal_ble_conn_cfg_t* config, hal_ble_conn_handle_t* connHandle) {
    CHECK_FALSE(connecting_, SYSTEM_ERROR_INVALID_STATE); // Device is connecting by peer device.
    CHECK_TRUE(connections_.size() < BLE_MAX_LINK_COUNT, SYSTEM_ERROR_LIMIT_EXCEEDED);
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(connHandle, SYSTEM_ERROR_INVALID_ARGUMENT);

    // Make sure that event dispatching is started
    CHECK(start());

    SCOPE_GUARD ({
        connectingAddr_ = {};
        connecting_ = false;
    });
    const hal_ble_conn_params_t* connParams = nullptr;
    if (config->conn_params == nullptr) {
        connParams = &ppcp_;
    } else {
        connParams = config->conn_params;
    }
    T_GAP_LE_CONN_REQ_PARAM platformConnParams;
    platformConnParams.scan_interval = scanParams_.interval;
    platformConnParams.scan_window = scanParams_.window;
    platformConnParams.conn_interval_min = connParams->min_conn_interval;
    platformConnParams.conn_interval_max = connParams->max_conn_interval;
    platformConnParams.conn_latency = connParams->slave_latency;
    platformConnParams.supv_tout = connParams->conn_sup_timeout;
    platformConnParams.ce_len_min = 2 * (platformConnParams.conn_interval_min - 1);
    platformConnParams.ce_len_max = 2 * (platformConnParams.conn_interval_max - 1);
    // NOTE: 2M and CODED PHYs are not supported. Refer to where GAP_CONN_PARAM_1M is defined.
    // TODO: As per the description of the API, it requires an existing connection?
    CHECK_RTL(le_set_conn_param(GAP_CONN_PARAM_1M, &platformConnParams));

    memcpy(&connectingAddr_, &config->address, sizeof(hal_ble_addr_t));
    uint8_t connLocalAddrType = GAP_LOCAL_ADDR_LE_PUBLIC;
    if (addr_.addr_type == BLE_SIG_ADDR_TYPE_RANDOM_STATIC) {
        connLocalAddrType = GAP_LOCAL_ADDR_LE_RANDOM;
    }
    centralLinkCbCache_.first = config->callback;
    centralLinkCbCache_.second = config->context;
    connecting_ = true;
    CHECK_RTL(WRAP_BLE_EVT_LOCK(le_connect(GAP_CONN_PARAM_1M, connectingAddr_.addr, (T_GAP_REMOTE_ADDR_TYPE)connectingAddr_.addr_type,
        (T_GAP_LOCAL_ADDR_TYPE)connLocalAddrType, BLE_DEFAULT_SCANNING_TIMEOUT)));
    if (os_semaphore_take(connectSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    auto connection = peekConnection(&config->address);
    CHECK_TRUE(connection.valid(), SYSTEM_ERROR_INTERNAL);
    *connHandle = connection.info.conn_handle;
    return SYSTEM_ERROR_NONE;
}

int BleGap::connectCancel(const hal_ble_addr_t* address) {
    CHECK_TRUE(connecting_, SYSTEM_ERROR_INVALID_STATE);
    CHECK_TRUE(address, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_TRUE(addressEqual(connectingAddr_, *address), SYSTEM_ERROR_INVALID_ARGUMENT);
    // NOTE: there is no API to cancel on-going connection attempt
    // We have to wait until it is connected followed by calling the disconnect API
    if (!WAIT_TIMED(BLE_OPERATION_TIMEOUT_MS, connecting_)) {
        return SYSTEM_ERROR_TIMEOUT;
    }
    auto connection = peekConnection(address);
    CHECK_TRUE(connection.valid(), SYSTEM_ERROR_NONE); // Connection is not established
    CHECK(disconnect(connection.info.conn_handle));
    return SYSTEM_ERROR_NONE;
}

int BleGap::disconnect(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(peekConnection(connHandle).valid(), SYSTEM_ERROR_NOT_FOUND);
    SCOPE_GUARD ({
        disconnectingHandle_ = BLE_INVALID_CONN_HANDLE;
    });
    disconnectingHandle_ = connHandle;
    CHECK_RTL(WRAP_BLE_EVT_LOCK(le_disconnect(connHandle)));
    if (os_semaphore_take(disconnectSemaphore_, BLE_OPERATION_TIMEOUT_MS, false)) {
        SPARK_ASSERT(false);
        return SYSTEM_ERROR_TIMEOUT;
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::disconnectAll() {
    while (1) {
        BleConnection* connection = nullptr;
        {
            std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
            if (connections_.size() > 0) {
                connection = &connections_[0];
            }
        }
        if (!connection) {
            break;
        }
        disconnect(connection->info.conn_handle);
    }
    return SYSTEM_ERROR_NONE;
}

void BleGap::notifyLinkEvent(const hal_ble_link_evt_t& event) {
    auto connection = peekConnection(event.conn_handle);
    if (connection.valid()) {
        if (connection.info.role == BLE_ROLE_CENTRAL) {
            if (connection.handler.first) {
                connection.handler.first(&event, connection.handler.second);
            }
        } else {
            for (const auto& handler : periphEvtCallbacks_) {
                if (handler.first) {
                    handler.first(&event, handler.second);
                }
            }
        }
    }
}

bool BleGap::valid(hal_ble_conn_handle_t connHandle) {
    return peekConnection(connHandle).valid();
}

BleGap::BleConnection* BleGap::fetchConnection(hal_ble_conn_handle_t connHandle) {
    CHECK_TRUE(connHandle != BLE_INVALID_CONN_HANDLE, nullptr);
    for (auto& connection : connections_) {
        if (connection.info.conn_handle == connHandle) {
            return &connection;
        }
    }
    return nullptr;
}

BleGap::BleConnection* BleGap::fetchConnection(const hal_ble_addr_t* address) {
    CHECK_TRUE(address, nullptr);
    for (auto& connection : connections_) {
        if (addressEqual(connection.info.address, *address)) {
            return &connection;
        }
    }
    return nullptr;
}

BleGap::BleConnection BleGap::peekConnection(hal_ble_conn_handle_t connHandle) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    if (connHandle != BLE_INVALID_CONN_HANDLE) {
        for (auto& connection : connections_) {
            if (connection.info.conn_handle == connHandle) {
                return connection;
            }
        }
    }
    return BleConnection();
}

BleGap::BleConnection BleGap::peekConnection(const hal_ble_addr_t* address) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    if (address != nullptr) {
        for (auto& connection : connections_) {
            if (addressEqual(connection.info.address, *address)) {
                return connection;
            }
        }
    }
    return BleConnection();
}

int BleGap::addConnection(BleConnection&& connection) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    CHECK_TRUE(fetchConnection(connection.info.conn_handle) == nullptr, SYSTEM_ERROR_INTERNAL);
    CHECK_TRUE(connections_.append(std::move(connection)), SYSTEM_ERROR_NO_MEMORY);
    return SYSTEM_ERROR_NONE;
}

void BleGap::removeConnection(hal_ble_conn_handle_t connHandle) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    size_t i = 0;
    for (const auto& connection : connections_) {
        if (connection.info.conn_handle == connHandle) {
            connections_.removeAt(i);
            return;
        }
        i++;
    }
}

