particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
int BleGap::setPairingConfig(const hal_ble_pairing_config_t* config) {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    CHECK_FALSE(connected(nullptr), SYSTEM_ERROR_INVALID_STATE);
    CHECK_FALSE(isScanning_, SYSTEM_ERROR_INVALID_STATE);
    if (btStackStarted_) {
        CHECK(stop());
        CHECK(init());
    }
    SCOPE_GUARD({
        start();
    });
    // Bit mask: GAP_AUTHEN_BIT_BONDING_FLAG, GAP_AUTHEN_BIT_MITM_FLAG, GAP_AUTHEN_BIT_SC_FLAG
    uint16_t authFlags = 0;
    if (config->algorithm == BLE_PAIRING_ALGORITHM_AUTO) {
        // Prefer LESC
        authFlags = GAP_AUTHEN_BIT_SC_FLAG;
    } else if (config->algorithm == BLE_PAIRING_ALGORITHM_LESC_ONLY) {
        authFlags = GAP_AUTHEN_BIT_SC_ONLY_FLAG | GAP_AUTHEN_BIT_SC_FLAG;
    }
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_AUTHEN_REQUIREMENTS_FLAGS, sizeof(authFlags), &authFlags));
    // IO Capabilities
    uint8_t ioCaps = toPlatformIoCaps(config->io_caps);
    CHECK_RTL(gap_set_param(GAP_PARAM_BOND_IO_CAPABILITIES, sizeof(ioCaps), &ioCaps));
    uint16_t secReqFlags = authFlags;
    if (config->io_caps != BLE_IO_CAPS_NONE) {
        secReqFlags |= GAP_AUTHEN_BIT_MITM_FLAG;
    }
    CHECK_RTL(le_bond_set_param(GAP_PARAM_BOND_SEC_REQ_REQUIREMENT, sizeof(secReqFlags), &secReqFlags));
    pairingConfig_ = {};
    pairingConfig_.size = sizeof(hal_ble_pairing_config_t);
    memcpy(&pairingConfig_, config, std::min(pairingConfig_.size, config->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::getPairingConfig(hal_ble_pairing_config_t* config) const {
    CHECK_TRUE(config, SYSTEM_ERROR_INVALID_ARGUMENT);
    memcpy(config, &pairingConfig_, std::min(pairingConfig_.size, config->size));
    return SYSTEM_ERROR_NONE;
}

int BleGap::setPairingAuthData(hal_ble_conn_handle_t connHandle, const hal_ble_pairing_auth_data_t* auth) {
    CHECK_TRUE(auth, SYSTEM_ERROR_INVALID_ARGUMENT);
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    if (auth->type == BLE_PAIRING_AUTH_DATA_NUMERIC_COMPARISON) {
        CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_STARTED, SYSTEM_ERROR_INVALID_STATE);
        connection->pairState = BLE_PAIRING_STATE_SET_AUTH_DATA;
        if (auth->params.equal) {
            CHECK_RTL(le_bond_user_confirm(connHandle, GAP_CFM_CAUSE_ACCEPT));
        } else {
            CHECK_RTL(le_bond_user_confirm(connHandle, GAP_CFM_CAUSE_REJECT));
        }
    }
    else if (auth->type == BLE_PAIRING_AUTH_DATA_PASSKEY) {
        CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_STARTED, SYSTEM_ERROR_INVALID_STATE);
        connection->pairState = BLE_PAIRING_STATE_SET_AUTH_DATA;
        for (uint8_t i = 0; i < BLE_PAIRING_PASSKEY_LEN; i++) {
            if (!std::isdigit(auth->params.passkey[i])) {
                LOG(ERROR, "Invalid digits.");
                CHECK_RTL(le_bond_passkey_input_confirm(connHandle, 0, GAP_CFM_CAUSE_REJECT));
                return SYSTEM_ERROR_INVALID_ARGUMENT;
            }
        }
        uint32_t passkey = std::atoi((const char*)auth->params.passkey);
        CHECK_RTL(le_bond_passkey_input_confirm(connHandle, passkey, GAP_CFM_CAUSE_ACCEPT));
    }
    else {
        LOG(ERROR, "SYSTEM_ERROR_NOT_SUPPORTED");
        return SYSTEM_ERROR_NOT_SUPPORTED;
    }
    return SYSTEM_ERROR_NONE;
}

int BleGap::startPairing(hal_ble_conn_handle_t connHandle) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    CHECK_TRUE(connection->pairState == BLE_PAIRING_STATE_NOT_INITIATED ||
               connection->pairState == BLE_PAIRING_STATE_REJECTED, SYSTEM_ERROR_INVALID_STATE);
    connection->pairState = BLE_PAIRING_STATE_INITIATED;
    auto ret = le_bond_pair(connHandle);
    if (ret != GAP_CAUSE_SUCCESS) {
        hal_ble_link_evt_t linkEvent = {};
        linkEvent.type = BLE_EVT_PAIRING_STATUS_UPDATED;
        linkEvent.conn_handle = connection->info.conn_handle;
        linkEvent.params.pairing_status.status = rtl_ble_error_to_system(ret);
        notifyLinkEvent(linkEvent);
        connection->pairState = BLE_PAIRING_STATE_NOT_INITIATED;
        return rtl_ble_error_to_system(ret);
    }
    return SYSTEM_ERROR_NONE;
}

/*
 * User may reject pairing under the following circumstances

 * If just work is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 * 
 * If passkey display is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 *   2. calling rejectPairing() on BLE_EVT_PAIRING_PASSKEY_DISPLAY received
 * 
 * If numeric comparison is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 *   2. calling rejectPairing() on BLE_EVT_PAIRING_NUMERIC_COMPARISON received
 *   3. choosing "NO" on BLE_EVT_PAIRING_NUMERIC_COMPARISON received
 *   4. not setting authentication data on BLE_EVT_PAIRING_NUMERIC_COMPARISON received
 * 
 * If passkey input is used:
 *   1. calling rejectPairing() on BLE_EVT_PAIRING_REQUEST_RECEIVED received
 *   2. calling rejectPairing() on BLE_EVT_PAIRING_PASSKEY_INPUT received
 *   3. entering wrong passkey on BLE_EVT_PAIRING_PASSKEY_INPUT received
 *   4. not setting authentication data on BLE_EVT_PAIRING_PASSKEY_INPUT received
 * 
 * Other circumstances are considered to continue the pairing process。
 */
int BleGap::rejectPairing(hal_ble_conn_handle_t connHandle) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    BleConnection* connection = fetchConnection(connHandle);
    CHECK_TRUE(connection, SYSTEM_ERROR_NOT_FOUND);
    // Note: If user called rejectPairing() after setPairingAuthData(), it won't take any effect
    if (connection->pairState == BLE_PAIRING_STATE_INITIATED || connection->pairState == BLE_PAIRING_STATE_STARTED) {
        connection->pairState = BLE_PAIRING_STATE_USER_REQ_REJECT;
    }
    return SYSTEM_ERROR_NONE;
}

