particle-iot/device-os/hal/src/rtl872x/ble_hal.cpp
bool BleGap::isPairing(hal_ble_conn_handle_t connHandle) {
    auto connection = peekConnection(connHandle);
    CHECK_TRUE(connection.valid(), false);
    return connection.pairState == BLE_PAIRING_STATE_INITIATED ||
           connection.pairState == BLE_PAIRING_STATE_STARTED ||
           connection.pairState == BLE_PAIRING_STATE_SET_AUTH_DATA ||
           connection.pairState == BLE_PAIRING_STATE_USER_REQ_REJECT;
}

bool BleGap::isPaired(hal_ble_conn_handle_t connHandle) {
    auto connection = peekConnection(connHandle);
    CHECK_TRUE(connection.valid(), false);
    return connection.pairState == BLE_PAIRING_STATE_PAIRED;
}

int BleGap::waitState(BleGapDevState state, system_tick_t timeout, bool forcePoll) {
    LOCAL_DEBUG("Enter waitState");
    bool ret = false;
    RtlGapDevState s;
    if (le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state) == GAP_CAUSE_SUCCESS) {
        LOCAL_DEBUG("waitState(), get: %02X, now: %02X", s.raw, state_.raw);
        if (!(state_.raw == s.raw)) {
            state_.raw = s.raw;
        }
        if (BleGapDevState(getState()).copySetParamsFrom(state) == state) {
            ret = true;
        }
    }
    if (ret) {
        LOCAL_DEBUG("Target state is already set, return.");
        return SYSTEM_ERROR_NONE;
    }

    auto now = hal_timer_millis(nullptr);
    auto end = now + timeout;
    auto current = BleGapDevState(getState());
    if (forcePoll || current.isNotInitialized() || !btStackStarted_) {
        // Poll, as some of the initial events are missing
        RtlGapDevState s;
        while (now < end) {
            CHECK_RTL(le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state));
            if (BleGapDevState(s).copySetParamsFrom(state) == state) {
                return SYSTEM_ERROR_NONE;
            }
            HAL_Delay_Milliseconds(BLE_WAIT_STATE_POLL_PERIOD_MS);
            now = hal_timer_millis(nullptr);
        }
    } else {
        for (now = now; now < end; now = hal_timer_millis(nullptr)) {
            os_semaphore_take(stateSemaphore_, end - now, false);
            LOCAL_DEBUG("os_semaphore_take: %d, t: %d", ret, end - now);
            if (BleGapDevState(getState()).copySetParamsFrom(state) == state) {
                return SYSTEM_ERROR_NONE;
            }
        }
    }
    return SYSTEM_ERROR_TIMEOUT;
}

void BleGap::handleDevStateChanged(T_GAP_DEV_STATE newState, uint16_t cause) {
    LOG_DEBUG(TRACE, "GAP state updated, init:%d, adv:%d, adv-sub:%d, scan:%d, conn:%d, cause:%d",
                        newState.gap_init_state, newState.gap_adv_state, newState.gap_adv_sub_state, newState.gap_scan_state, newState.gap_conn_state, cause);
    RtlGapDevState nState;
    nState.state = newState;
    // In case of race condition in stack
    RtlGapDevState s;
    if (le_get_gap_param(GAP_PARAM_DEV_STATE, &s.state) == GAP_CAUSE_SUCCESS && nState.raw != s.raw) {
        LOCAL_DEBUG("!!!!!!!!! Race condition. Notified: %02X, Get: %02X", nState.raw, s.raw);
        nState.state = s.state;
    }
    // NOTE: this event is generated before the connection is established
    if (nState.state.gap_adv_state != state_.state.gap_adv_state && nState.state.gap_adv_state == GAP_ADV_STATE_IDLE) {
        if (nState.state.gap_adv_sub_state == GAP_ADV_TO_IDLE_CAUSE_CONN) {
            isAdvertising_ = false; // adv timer has higher priority, just in case that the BLE_CMD_STOP_ADV_NOTIFY
                                    // has been enqueued, followed by nontifying the ADV stopped event. Under
                                    // certain circumstance notifying the ADV stopped event will cause BLE re-adv,
                                    // e.g. in BLE listening mode.
            if (os_timer_is_active(advTimeoutTimer_, nullptr)) {
                os_timer_change(advTimeoutTimer_, OS_TIMER_CHANGE_STOP, hal_interrupt_is_isr() ? true : false, 0, 0, nullptr);
            }
        }
    }
    state_.raw = nState.raw;
    os_semaphore_give(stateSemaphore_, false);
}

void BleGap::handleConnectionStateChanged(uint8_t connHandle, T_GAP_CONN_STATE newState, uint16_t discCause) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    switch (newState) {
        case GAP_CONN_STATE_CONNECTING: {
            LOG_DEBUG(TRACE, "Connecting...");
            connecting_ = true;
            break;
        }
        case GAP_CONN_STATE_DISCONNECTING: {
            LOG_DEBUG(TRACE, "Disconnecting...");
            break;
        }
        case GAP_CONN_STATE_DISCONNECTED: {
            LOG_DEBUG(TRACE, "GAP_CONN_STATE_DISCONNECTED");
            BleConnection* connection = fetchConnection(connHandle);
            if (!connection || (connection && addressEqual(connectingAddr_, connection->info.address))) {
                if (connecting_) {
                    connecting_ = false;
                }
                hal_ble_addr_t dummyAddr = {};
                if (!addressEqual(connectingAddr_, dummyAddr)) {
                    os_timer_change(attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, false, 0, 0, nullptr);
                    // connecting_ might have been set to false on GAP_CONN_STATE_CONNECTED event, but the ATT MTU callback is not invoked
                    // Central failed to connect
                    os_semaphore_give(connectSemaphore_, false);
                }
                if (!connection) {
                    return;
                }
            }
            if ((discCause != (HCI_ERR | HCI_ERR_REMOTE_USER_TERMINATE)) && (discCause != (HCI_ERR | HCI_ERR_LOCAL_HOST_TERMINATE))) {
                LOG(TRACE, "handleConnectionStateChanged: connection lost cause 0x%x", discCause);
            }
            LOG_DEBUG(TRACE, "Disconnected, handle:%d, cause:0x%x", connHandle, discCause);
            // If the disconnection is initiated by application.
            if (disconnectingHandle_ == connection->info.conn_handle) {
                os_semaphore_give(disconnectSemaphore_, false);
            }
            // Notify the disconnected event.
            hal_ble_link_evt_t evt = {};
            evt.type = BLE_EVT_DISCONNECTED;
            evt.conn_handle = connHandle;
            evt.params.disconnected.reason = (uint8_t)discCause;
            notifyLinkEvent(evt);
            hal_ble_role_t role = connection->info.role;
            removeConnection(connHandle);
            BleGatt::getInstance().removeSubscriber(connHandle);
            if (role == BLE_ROLE_PERIPHERAL) {
                SCOPE_GUARD ({
                    if (autoAdvCfg_ == BLE_AUTO_ADV_SINCE_NEXT_CONN) {
                        autoAdvCfg_ = BLE_AUTO_ADV_ALWAYS;
                    }
                });
                // FIXME: check whether it's enabled?
                if (isAdvertising()) {
                    enqueue(BLE_CMD_STOP_ADV);
                    enqueue(BLE_CMD_START_ADV);
                    return;
                }
                if (autoAdvCfg_ == BLE_AUTO_ADV_FORBIDDEN || autoAdvCfg_ == BLE_AUTO_ADV_SINCE_NEXT_CONN) {
                    return;
                }
                enqueue(BLE_CMD_START_ADV);
            }
            break;
        }
        case GAP_CONN_STATE_CONNECTED: {
            LOG_DEBUG(TRACE, "GAP_CONN_STATE_CONNECTED");
            hal_ble_conn_params_t connParams = {};
            connParams.version = BLE_API_VERSION;
            connParams.size = sizeof(hal_ble_conn_params_t);
            hal_ble_addr_t peerAddr = {};
            peerAddr.addr_type = BLE_SIG_ADDR_TYPE_PUBLIC;
            le_get_conn_addr(connHandle, peerAddr.addr, (uint8_t *)&peerAddr.addr_type);
            auto existingConnection = fetchConnection(connHandle);
            if (existingConnection) {
                // Some other event might have already initialized the connection object
                if (!addressEqual(peerAddr, existingConnection->info.address)) {
                    LOG(ERROR, "Peer addresses do not match");
                    disconnect(connHandle);
                }
                return;
            }
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connParams.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connParams.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connParams.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "Connected, interval:0x%x, latency:0x%x, timeout:0x%x peer: %02x:%02x:%02x:%02x:%02x:%02x",
                            connParams.max_conn_interval, connParams.slave_latency, connParams.conn_sup_timeout,
                            peerAddr.addr[0], peerAddr.addr[1], peerAddr.addr[2], peerAddr.addr[3], peerAddr.addr[4], peerAddr.addr[5]);

            BleConnection connection = {};
            connection.info.version = BLE_API_VERSION;
            connection.info.size = sizeof(hal_ble_conn_info_t);
            if (addressEqual(connectingAddr_, peerAddr)) {
                connection.info.role = BLE_ROLE_CENTRAL;
                connection.handler = centralLinkCbCache_;
                LOG_DEBUG(TRACE, "Connected as Central");
            } else {
                connection.info.role = BLE_ROLE_PERIPHERAL;
                connecting_ = false;
                LOG_DEBUG(TRACE, "Connected as Peripheral");
            }
            connection.info.conn_handle = connHandle;
            connection.info.conn_params = connParams;
            connection.info.address = peerAddr;
            connection.info.att_mtu = BLE_DEFAULT_ATT_MTU_SIZE; // Use the default ATT_MTU on connected.
            connection.pairState = BLE_PAIRING_STATE_NOT_INITIATED;
            int ret = addConnection(std::move(connection));
            if (ret != SYSTEM_ERROR_NONE) {
                LOG(ERROR, "Add new connection failed. Disconnects from peer.");
                disconnect(connHandle);
                return;
            }
            hal_ble_link_evt_t evt = {};
            evt.type = BLE_EVT_CONNECTED;
            evt.conn_handle = connHandle;
            evt.params.connected.info = &connection.info;
            notifyLinkEvent(evt);
            if (connecting_ && connection.info.role == BLE_ROLE_CENTRAL) {
                // Postpone setting connecting_ = false until MTU exchange happens (or times out)
                // as by the standard you are not allowed to perform any reads/writes etc during an MTU exchange
                SPARK_ASSERT(!os_timer_is_active(attMtuExchangeTimer_, nullptr));
                os_timer_set_id(attMtuExchangeTimer_, (void*)(uintptr_t)connHandle);
                if (!os_timer_change(attMtuExchangeTimer_, OS_TIMER_CHANGE_START, false, 0, 0, nullptr)) {
                    LOG(ERROR, "Failed to start MTU exchange timer");
                    os_semaphore_give(connectSemaphore_, false);
                }
                // See: handleMtuUpdated()
                // connecting_ = false;
                // os_semaphore_give(connectSemaphore_, false);
            }
            break;
        }
        default: break;
    }
}

void BleGap::handleMtuUpdated(uint8_t connHandle, uint16_t mtuSize) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    LOG_DEBUG(TRACE, "handleMtuUpdated: handle:%d, mtu_size:%d", connHandle, mtuSize);
    BleConnection* connection = fetchConnection(connHandle);
    if (!connection && connecting_ && mtuSize != 0) {
        // Race condition in the stack
        LOG_DEBUG(WARN, "handleMtuUpdated force adding connection");
        handleConnectionStateChanged(connHandle, GAP_CONN_STATE_CONNECTED, 0);
        connection = fetchConnection(connHandle);
    }
    if (!connection) {
        return;
    }
    if (os_timer_is_active(attMtuExchangeTimer_, nullptr)) {
        os_timer_change(attMtuExchangeTimer_, OS_TIMER_CHANGE_STOP, false, 0, 0, nullptr);
    }
    // FIXME: when device initiates the connection establishment,
    // it will perform the ATT MTU exchange automatically on connected. This may result in
    // service discovery failure when the peer device is of other Gen3 platform.
    if (connection->info.role == BLE_ROLE_CENTRAL && connecting_) {
        connecting_ = false;
        os_semaphore_give(connectSemaphore_, false);
    }
    if (mtuSize != 0) {
        connection->info.att_mtu = mtuSize;
        hal_ble_link_evt_t evt = {};
        evt.type = BLE_EVT_ATT_MTU_UPDATED;
        evt.conn_handle = connHandle;
        evt.params.att_mtu_updated.att_mtu_size = mtuSize;
        notifyLinkEvent(evt);
    }
}

void BleGap::handleConnParamsUpdated(uint8_t connHandle, uint8_t status, uint16_t cause) {
    std::lock_guard<RecursiveMutex> lk(connectionsMutex_);
    BleConnection* connection = fetchConnection(connHandle);
    if (!connection && connecting_) {
        // Race condition in the stack
        LOG_DEBUG(WARN, "handleConnParamsUpdated force adding connection");
        handleConnectionStateChanged(connHandle, GAP_CONN_STATE_CONNECTED, 0);
        connection = fetchConnection(connHandle);
    }
    if (!connection) {
        return;
    }
    switch (status) {
        case GAP_CONN_PARAM_UPDATE_STATUS_SUCCESS: {
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connection->info.conn_params.min_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_INTERVAL, &connection->info.conn_params.max_conn_interval, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_LATENCY, &connection->info.conn_params.slave_latency, connHandle);
            le_get_conn_param(GAP_PARAM_CONN_TIMEOUT, &connection->info.conn_params.conn_sup_timeout, connHandle);
            LOG_DEBUG(TRACE, "handleConnParamsUpdated: update success: interval:0x%x, latency:0x%x, timeout:0x%x",
                            connection->info.conn_params.max_conn_interval, connection->info.conn_params.slave_latency, connection->info.conn_params.conn_sup_timeout);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_FAIL: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update failed: cause 0x%x", cause);
            break;
        }
        case GAP_CONN_PARAM_UPDATE_STATUS_PENDING: {
            LOG_DEBUG(TRACE, "handleConnParamsUpdated, update pending: conn_id %d", connHandle);
            break;
        }
        default: break;
    }
}

